---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsPathType
source: html/36994970-3d80-62a3-df6f-381d38f2eda0.htm
---
# Autodesk.Revit.DB.Architecture.StairsPathType

An object represents the stairs path type.

## Syntax (C#)
```csharp
public class StairsPathType : ElementType
```